In [1]:
import pandas as pd

#### **Display the head of the dataframe**

In [33]:
df = pd.read_csv('https://raw.githubusercontent.com/gumdropsteve/intro_to_python/main/day_09/data/titanic.csv')
df.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

#### **What is the percentage of people who survived? (hint find the mean of the survival column)**

In [24]:
df["Survived"].value_counts(normalize=True)

0    0.616162
1    0.383838
Name: Survived, dtype: float64

#### **How many women and how many men survived?**

In [19]:
df.groupby(["Sex", "Survived"])["PassengerId"].count()

Sex     Survived
female  0            81
        1           233
male    0           468
        1           109
Name: PassengerId, dtype: int64

#### **What is the percentage of people that survied who paid a fare less than 10?**

In [12]:
df[(df["Survived"] == 1) & (df["Fare"] < 10)]["Survived"].count()/df.shape[0]

0.07519640852974187

#### **What is the average age of those who didn't survive?**

In [34]:
df[df["Survived"] == 0]["Age"].mean()

30.62617924528302

#### **What is the average age of those who did survive?**

In [15]:
df[df["Survived"] == 1]["Age"].mean()

28.343689655172415

#### **What is the average age of those who did and didn't survive grouped by gender?**

In [16]:
df.groupby(["Sex", "Survived"])["Age"].mean()

Sex     Survived
female  0           25.046875
        1           28.847716
male    0           31.618056
        1           27.276022
Name: Age, dtype: float64

#### **Manipulate the GDP.csv file and make it tidy, the result should be a pandas dataframe with the following columns:**

- Country Name
- Country Code
- Year
- GDP

In [32]:
df2 = pd.read_csv("https://raw.githubusercontent.com/gumdropsteve/intro_to_python/main/day_09/data/gdp.csv")\
.drop(["Indicator Name", "Indicator Code", "Unnamed: 62"], axis=1)\
.melt(id_vars=["Country Name", "Country Code"],var_name=["Year"],value_name="GDP")\

df2

       Country Name Country Code  Year           GDP
0             Aruba          ABW  1960           NaN
1       Afghanistan          AFG  1960  5.377778e+08
2            Angola          AGO  1960           NaN
3           Albania          ALB  1960           NaN
4           Andorra          AND  1960           NaN
...             ...          ...   ...           ...
15307        Kosovo          XKX  2017  7.128691e+09
15308   Yemen, Rep.          YEM  2017           NaN
15309  South Africa          ZAF  2017  3.494193e+11
15310        Zambia          ZMB  2017  2.580867e+10
15311      Zimbabwe          ZWE  2017  1.784582e+10

[15312 rows x 4 columns]